Revit 2024 API
MultistoryStairs.GetAllConnectedLevels Method
 Gets all connected level ids of this multistory stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public ISet<ElementId> GetAllConnectedLevels()
Visual Basic
Public Function GetAllConnectedLevels As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetAllConnectedLevels()
Return Value
 The ids of connected levels.
See Also
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace